# Классификация комментариев 

## Задача
Интернет-магазин запускает новый сервис. Теперь пользователи могут редактировать и дополнять описания товаров, как в вики-сообществах. То есть клиенты предлагают свои правки и комментируют изменения других. Магазину нужен инструмент, который будет искать токсичные комментарии и отправлять их на модерацию.

В нашем распоряжении набор данных с разметкой о токсичности правок.
Необходимо обучить модель классифицировать комментарии на позитивные и негативные.

Постройте модель со значением метрики качества F1 не меньше 0.75.

## Данные
В нашем распоряжении набор данных с разметкой о токсичности правок.  
Столбец `text` содержит текст комментария, а `toxic` — целевой признак.

## Используемые библиотеки
numpy, pandas, spacy, re, nltk, sklearn, catboost
